In [ ]:
import pandas as pd

In [ ]:
marks_dict = {"Name": ["Alice", "Bob", "Charlie"], 
              "Math": [80, 70, 90], 
              "Science": [85, 75, 95], 
              "English": [78, 82, 88] }

In [10]:
marksDataFrame = pd.DataFrame(marks_dict)
marksDataFrame

      Name  Math  Science  English
0    Alice    80       85       78
1      Bob    70       75       82
2  Charlie    90       95       88

In [13]:
OnlyMarksDataFrame = marksDataFrame.loc[:,"Math":"English"]
OnlyMarksDataFrame

   Math  Science  English
0    80       85       78
1    70       75       82
2    90       95       88

In [14]:
OnlyMarksDataFrame.mean().round(2).to_dict()

{'Math': 80.0, 'Science': 85.0, 'English': 82.67}